global.timeFormat = 'HH:mm:ss'
global.dateFormat = 'DD.MM.YYYY'

primaryColor = '#6bbf5f'
tipColor = '#505050'
dangerColor = '#e24848'
goodColor = '#01c056'

workTypes = {
  'W': 'Работает',
	'H': 'Вых.',
	'V': 'Отп.',
	'A': 'Отсут.',
	'E': '-' // E -- empty
}

userGroups = {
	'C': 'Сотрудник',
	'M': 'Менеджер',
	'S': 'Руководитель',
	'D': 'Директор',
	'H': 'ЦО'
}

months =  {
	0: 'Январь',
	1: 'Февраль',
	2: 'Март',
	3: 'Апрель',
	4: 'Май',
	5: 'Июнь',
	6: 'Июль',
	7: 'Август',
	8: 'Сентябрь',
	9: 'Октябрь',
	10: 'Ноябрь',
	11: 'Декабрь'
}

weekdays = {
	0: 'Понедельник',
	1: 'Вторник',
	2: 'Среда',
	3: 'Четверг',
	4: 'Пятница',
	5: 'Суббота',
	6: 'Воскресенье'
}